Repository: OpenChain-Project/Reference-Material
Catalog: Official-Project-FAQ/1.0/jp/OmegaT/OpenChain-FAQ-level2.tmx
Source language: en_us
Languages: ja

source: OpenChain focuses on i) improving compliance programs within organizations that use FOSS from different projects in their solutions and ii) the process for contributing back.
ja: OpenChain は、i) 組織外のプロジェクトから供給されるFOSSを自組織のソリューションに活用する組織においてコンプライアンス プログラムを改善することと、ii) FOSSコミュニティーへ成果を還元するためのプロセスにフォーカスしています。

source: OpenChain builds trust in Open Source by making things simpler, more efficient and more consistent.
ja: OpenChain は、物事をよりシンプルに、より効率的に、そしてより首尾一貫させることにより、オープンソースの世界に信頼を築きます。

source: A company that completes the Online Self-Certification confirms they meet the OpenChain Specification requirements.
ja: オンライン自己認証を完了した会社は、 OpenChain 仕様の要件を満足していると確認できます。

source: A copy of the license can be obtained here: CC-BY-4.0
ja: このライセンスのコピーはこちらで入手できます。 CC-BY-4.0

source: A software supplier may declare the software offered was prepared under an OpenChain conforming program.
ja: ソフトウェアのサプライヤは、そのソフトウェアが OpenChain に適合したコンプライアンス プログラム下で用意されたと宣言することができます。

source: All Artifacts should be verified internally by the organization using them.
ja: すべての証跡は、それらを使用する組織によって内部的に検証されなければなりません。

source: Although artifacts must exist, one is not required to make them public.
ja: 証跡は存在していなければなりませんが、それらを公開する必要はありません。

source: Although currently an audit by a third party is not a requirement of the OpenChain specification, a partner or customer may ask for evidence of the Verification Artifacts as a condition for doing business (e.g., under an Non-Disclosure agreement).
ja: 現在のところ、第三者による監査は OpenChain 仕様の要件ではありませんが、パートナーや顧客は、ビジネスを行う条件として、(たとえば機密保持契約を締結した上で) 検証すべき証跡の証拠を要求することができます。

source: Any omissions or incorrect answers will be reported by the user.
ja: 情報の欠落や正しくない回答は、そのユーザによって報告されます。

source: Are these slides everything you need to be compliant with licenses?
ja: これらのスライドが、ライセンスを順守するために必要なことのすべてですか？

source: Artifacts are a tangible by-product of implementing OpenChain conformance policies.
ja: 証跡とは、 OpenChain 適合ポリシーを実施することによる有形の副産物です。

source: Assign Responsibility for Achieving Compliance
ja: コンプライアンスを履行するための責任者のアサイン

source: A FOSS compliance program which the software is prepared under is a candidate for OpenChain conformance.
ja: そのソフトウェアを用意するにあたって適用された FOSS コンプライアンス プログラムが、 OpenChain 適合判定の候補となります。

source: Certify Adherence to OpenChain Requirements
ja: OpenChain 要件適合の認定

source: Clicking this button will cancel your previous OpenChain Self-Certification submission.
ja: このボタンをクリックすることで、 以前の OpenChain 自己認証の提出内容をキャンセルできます。

source: Companies need to take this into account when considering the use of the reference slides for in-house training.
ja: この参照スライドを社内トレーニングに使用する際は、このことを考慮に入れる必要があります。

source: Compliance artifacts consist of: source code, build scripts, license copies, attribution notices, modification notices and other materials open source licenses governing a software deliverable may require.
ja: コンプライアンス 証跡は、あるソフトウェア配布物を支配するオープンソース ライセンスが要求する、ソースコード、ビルドスクリプト、ライセンス文書、帰属の通知、改変の通知などの文書類からなります。

source: Conformance Working Group – helps companies check that they are adhering to the Specification requirements.
ja: 適合性ワーキング グループ – 企業が仕様の要件を順守しているかどうかをチェックする手助けをします。

source: Curriculum Working Group – provides training material to help companies meeting the Specification education requirements.
ja: カリキュラム ワーキンググループ – トレーニング用資料を提供することで、仕様に規定された教育要件を満たす手助けをします

source: Deliver FOSS Content Documentation and Artifacts
ja: FOSSコンテンツ ドキュメントとコンプライアンス関連資料の頒布

source: Different legal jurisdictions have different legal requirements.
ja: 異なる法域には異なる法的要件があります。

source: Do resources exist to assist my organization in achieving OpenChain Conformance?
ja: 私の組織が OpenChain 適合を達成するのを支援するリソースは、存在しますか？

source: Does OpenChain program conformance guarantee license compliance?
ja: OpenChain プログラムに適合すればライセンスへのコンプライアンスは保証されますか？

source: Does all software in an organization need to be covered by an OpenChain Conforming program to achieve program conformance?
ja: プログラムの適合を達成するために、一つの組織のすべてのソフトウェアが OpenChain に適合したプログラムによって取り扱われる必要がありますか？

source: Does a FOSS program need to satisfy all the requirements of the specification to be considered OpenChain Conforming?
ja: FOSS プログラムが OpenChain 適合と見なされるためには、仕様のすべての要件を満足する必要がありますか？

source: Does the specification describe how to comply with the most popular FOSS licenses?
ja: この仕様は、よく使われるFOSSライセンスをどのように順守するかについて記述されていますか？

source: Does the specification serve as a best practice guide?
ja: この仕様は一つのベストプラクティスガイドとして使えますか？

source: Each requirement is a description of an important quality a FOSS program must maintain.
ja: 各要件は、FOSS プログラムが維持すべき重要な品質を記述したものです。

source: Email openchain-conformance@linux-foundation.com with any issues.
ja: 何か問題がありましたら openchain-conformance@linux-foundation.com に email でご連絡ください。

source: Email openchain-conformance@linux-foundation.com with the name of the organization you are concerned about and the reason you disagree with their submission.
ja: あなたが懸念を持っている組織の名前と、同意できない理由を明記して、 openchain-conformance@linux-foundation.com に email でご連絡ください。

source: Everyone is invited to participate, contribute material and to assist expanding existing material.
ja: 誰もが参加を歓迎され、資料を提供したり既存の資料の拡張を支援することができます。

source: Follow the Getting Started instructions on the OpenChain Conformance page .
ja: OpenChain Conformance ページ の「Getting Started」の説明 (英文) をご覧ください。

source: Furthermore the specification requires that a process exists that ensures the appropriate attention is given to license obligation analysis and and fulfillment.
ja: さらにこの仕様は、ライセンスの義務の分析 と 履行に対して適切な注意が払われることを確かにするプロセスが存在することを要求しています。

source: General Questions
ja: 一般的な質問

source: Governing Board – Manage policies or rules and procedures for the Project, fund raising , budgeting and so forth.
ja: ガバニング ボード – プロジェクト、資金集め、 予算 その他についての方針やルールと手続きを管理します。

source: How can I contribute?
ja: プロジェクトに貢献するにはどうすればよいですか？

source: How can companies or individuals contribute to the OpenChain Curriculum?
ja: どうすれば会社や個人が OpenChain カリキュラムに貢献できますか？

source: How do I know who conforms to OpenChain ?
ja: OpenChain に適合している組織はどうすればわかりますか?

source: How do I report issues with the Online Self-Certification Web App?
ja: オンライン自己認証ウェブアプリに関する問題は、どのように報告すればよいですか？

source: How does OpenChain work?
ja: OpenChain の取り組みを教えてください。

source: How was the specification developed?
ja: この仕様はどのようにして開発されましたか？

source: If all information is correct, the submittal will automatically be approved by the system.
ja: もしすべての情報が正しければ、提出はシステムによって自動的に承認されます。

source: In contrast, the CII best practices badge focuses on criteria for well-run FOSS projects themselves.
ja: これに対して、CII Best Practices Badge は、FOSSプロジェクト自体を良い状態で運営するための基準にフォーカスしています。

source: In order to ensure there are no significant gaps in an OpenChain conforming program that could lead to poor quality output, a program must satisfy all the requirements to be considered OpenChain conforming.
ja: OpenChain 適合プログラムに、低品質なアウトプットを引き起こしかねない著しいギャップがないことを確実にするため、コンプライアンス プログラムが OpenChain 適合と見なされるためにはすべての用件を満足しなければなりません。

source: Is a third party audit required to declare a FOSS program to be OpenChain Conforming?
ja: FOSS プログラムが OpenChain 適合であることを宣言するために、第三者による監査は必要ですか？

source: It does require an organization to designate a legal expert who can assist with legal guidance.
ja: そうではなく、この仕様は、法的ガイダンスの支援を提供する法律のエキスパートを、組織が指名することを要求しています。

source: It focuses on the “what and why” aspects of a program and not the how or when.
ja: そのため、この仕様は「何を」と「なぜ」の側面にフォーカスしており、「どうやって」や「いつ」には触れていません。

source: It has been discussed that a future version of the specification may provide more specific guidelines on how to obtain third party certification.
ja: 第三者による認証をどのようにして得るかについてのもっと具体的なガイドラインを、本仕様の将来の版において提示する可能性について、議論がなされています。

source: It is intended to help companies either get started with an OpenChain conformant compliance training program or to expand on existing training programs to help conform with the OpenChain Specification.
ja: 会社が OpenChain 適合のコンプライアンス トレーニング プログラムに 着手 したり、既存のトレーニング プログラムを OpenChain 仕様に適合させるのを手助けすることを意図しています。

source: It is the industry-standard for managing Open Source compliance across the supply chain.
ja: つまりこれは、サプライチェーン全体にわたってオープンソースのコンプライアンスを達成するための業界標準規格です。

source: It can be found at https://certification.openchainproject.org/ .
ja: こちらからどうぞ。 https://certification.openchainproject.org/

source: Know Your FOSS Responsibilities [i.e., “Policy and Training”]
ja: FOSSに関わる責任の理解 [すなわちポリシーとトレーニング]

source: No, but it significantly increases the probability that license compliance will be achieved for software releases prepared under a OpenChain conforming program.
ja: いいえ。しかし OpenChain 適合プログラム下で用意されたソフトウェアリリースについては、ライセンスへのコンプライアンスが達成される可能性が著しく高まります。

source: No, this is a reference deck.
ja: いいえ。これはあくまでも参照資料集です。

source: No.
ja: いいえ。

source: One should not associate software with OpenChain conformance if it has not been reviewed under a program that has been assessed to be OpenChain conforming.
ja: ソフトウェアが OpenChain に適合済のプログラム下でレビューされていない場合、そのソフトウェアを OpenChain 適合性と結びつけることはできません。

source: One FOSS program within an organization can be classified as OpenChain conforming if it satisfies the specification requirements while another program may not.
ja: 一つの組織内の一つの FOSS プログラムが仕様の要件を満足していれば OpenChain 適合と格付けできる一方で、別のプログラムがそのように格付けできなくても構いません。

source: OpenChain Conformance
ja: OpenChain 適合について

source: OpenChain Curriculum
ja: OpenChain カリキュラムについて

source: OpenChain Self-Certification is designed to assess the status of OpenChain Conformance in relation to a specific version of the OpenChain Specification .
ja: OpenChain 自己認証は、個別のバージョンごとの OpenChain 仕様 に関して、OpenChain 適合 の状態を評価できるように設計されています。

source: OpenChain Specification
ja: OpenChain 仕様について

source: OpenChain and the CII Best Practices are both Linux Foundation initiatives that identify FOSS process quality criteria.
ja: OpenChain と CII Best Practices はいずれも、FOSS プロセスの品質基準を明確化するための Linux Foundation の取り組みです。

source: Organizations are sometimes composed of different groups and/or departments which may have different programs and release procedures (e.g., engineering vs professional services).
ja: 組織は、異なるプログラムとリリース手順を持つ複数のグルーブや部門から構成されていることがよくあります (たとえば、エンジニアリング部門 と 専門的サービスを提供する部門)。

source: Organizations of any size can accomplish Self-Certification through the OpenChain Project Online Self-Certification Web App.
ja: いかなる大きさの組織も、 OpenChain プロジェクトのオンライン自己認証ウェブアプリによって、自己認証を行えます。

source: Our Specification creates trust between organizations.
ja: OpenChainの仕様は、組織と組織の間に信頼を創出します。

source: Our Conformance allows new organizations to join the circle of trust.
ja: OpenChainに適合することで、組織は信頼の輪の中に入ることができます。

source: Our Curriculum supports implementation by entities of any size.
ja: OpenChainのカリキュラムは、組織の大小を問わず適用できます。

source: Outreach Committee – Designing, developing and executing efforts to build an OpenChain compliance ecosystem throughout relevant supply chains in collaboration with the Governing Board.
ja: アウトリーチ コミッティー – ガバニング ボードと連携して、オープンソースと関連のあるサプライチェーン全体にわたって OpenChain コンプライアンス エコシステムを構築するための施策を設計、開発および実行します。

source: Please include specific information on the issue you have encountered.
ja: その際には、遭遇した問題について具体的な情報を記載してください。

source: Review and approve FOSS content
ja: FOSSコンテンツのレビューと承認

source: See the CII Best Practices website if you are interested in getting a CII Best Practices badge.
ja: CII Best Practices Badge の取得に関心のある方は、 CII Best Practices ウェブサイト をご覧ください。

source: Similarly, a software recipient may ask the supplier if the software they received was prepared under an OpenChain conforming program.
ja: 同様に、ソフトウェアを受け取る側はサプライヤに対して、受け取ったソフトウェアが OpenChain に適合したプログラム下で用意されたかどうかを尋ねることができます。

source: Specification Working Group – identifies and publishes a set of core requirements a quality FOSS compliance program should satisfy.
ja: 仕様ワーキング グループ – FOSSコンプライアンスプログラムが満足すべき一連の要件を明確化し公表します。

source: Steering Committee – Development, management and updating of the OpenChain Compliance Specification.
ja: ステアリング コミッティー – OpenChain コンプライアンス仕様の開発、管理および更新。

source: Supplied software itself is not identified as being OpenChain Conforming.
ja: 供給されるソフトウェア自体については OpenChain 適合かどうかの判別はしません。

source: That is, the obligation to provide evidence of the existence of the artifacts, and the willingness to do so, is determined by the relationship entered into by two parties.
ja: すなわち、証跡の存在の証拠を提示する義務や、それを進んで提示する意思は、当事者同士が結ぶ関係性によって決まります。

source: The OpenChain Curriculum is intended to help companies shipping Open Source Software and the companies receiving such software through the supply chain.
ja: OpenChain カリキュラムは、オープンソース ソフトウェアを出荷したり、そのようなソフトウェアをサプライチェーンから受け取る会社の手助けとなることを意図しています。

source: The OpenChain Curriculum reference slides are focused on US law.
ja: OpenChain カリキュラムの参照スライドは、米国の法規にフォーカスしています。

source: The OpenChain Curriculum slide deck provides reference material to meet OpenChain specification 1.0, requirement 1.2.
ja: OpenChain カリキュラムのスライド資料集は OpenChain 仕様 1.0、要件 1.2 を満足するための参照資料になります。

source: The OpenChain Curriculum working group has developed training reference materials that greatly facilitate the creation (or enhancement) of a FOSS compliance training program.
ja: OpenChain カリキュラム ワーキンググループは、FOSS コンプライアンス トレーニング プログラムの作成 (または強化) を大いに促進する参照トレーニング資料を開発しました。

source: The OpenChain Project has three working groups open for anyone to contribute to:
ja: OpenChain プロジェクトは三つのワーキング グループからなり、誰でも参加して貢献することができます。

source: The OpenChain Project helps to identify and share the core components of a high quality Free and Open Source Software (FOSS) compliance program.
ja: OpenChain プロジェクトは、フリー／オープンソース ソフトウェア (FOSS) についての高品質なコンプライアンスプログラムの核となる構成要素を明確化し、共有していきます。

source: The OpenChain Project accepted input from dozens of individuals, companies and organizations that have experience preparing for and/or exchanging software in the software supply chain.
ja: OpenChain プロジェクトは、ソフトウェア サプライチェーンの中でソフトウェアの作成ややり取りを経験してきた多数の個人、会社、組織からの提案を受け入れました。

source: The OpenChain Specification is simply structured to provide a list of requirements where each requirement maintains a set of acceptance criteria (Verification Artifacts).
ja: OpenChain 仕様は、シンプルな構成で要件のリストを提供しており、各要件には一連の合否判定基準 (検証すべき証跡) が規定されています。

source: The OpenChain Conformance working group has developed a questionnaire to guide an organization in self-certifying a program to be OpenChain conforming.
ja: OpenChain 適合ワーキンググループは、プログラムが OpenChain 適合であることを組織が自己認証する際に指針となる質問表を開発しました。

source: The OpenChain Project has identified 6 main categories of a compliance program and important tasks and deliverables for each category.
ja: OpenChain プロジェクトは、コンプライアンス プログラムの六つの主要なカテゴリーと、各カテゴリーについて重要なタスクと成果物を明確化しました。

source: The Linux Foundation sponsors various open source projects and initiatives that provide useful tools and compliance program resources that can help implement an OpenChain FOSS compliance program (e.g., SPDX , FOSSology , …) .
ja: Linux Foundation は OpenChain FOSS コンプライアンス プログラムの実施を助ける便利なツールやコンプライアンス プログラムのリソース (たとえば SPDX , FOSSology , …) を提供するさまざまなオープンソース プロジェクトや取り組みに資金提供しています。

source: The Verification Artifacts for a requirement represent a list of tangible artifacts that must exist in order for one to determine the specific requirement has been met.
ja: 一つの要件についての検証すべき証跡は、仕様の要件を満足していることを判定するために存在していなければならない具体的な証跡のリストの形で提示されています。

source: The key goal of the specification is to foster trust around FOSS compliance between two parties exchanging software.
ja: この仕様の究極のゴールは、ソフトウェアをやり取りする当事者間にFOSSコンプライアンスについての信頼関係を育てることです。

source: The main objective of the specification provides a set of requirements that would help one evaluate whether an existing FOSS compliance program is sufficient.
ja: この仕様の主要な目的は、既存のFOSS コンプライアンス プログラムが十分かどうかを評価する手助けとなる一連の要件を提供することです。

source: The reference slides are designed to be delivered in a half day training session.
ja: この参照スライドは、半日のトレーニングセッションで伝達されるように作られています。

source: The result is that Open Source becomes predictable, understandable and optimized for internal and external supply chains of any type.
ja: その結果、オープンソースは組織内外の様々なタイプのサプライチェーンにふさわしく最適化され、見通し良くわかりやすいものになります。

source: The specification does not provide legal guidance.
ja: この仕様は、法的なガイダンスを提供するものではありません。

source: The specification is licensed under the Creative Commons Attribution License 4.0 (CC-BY-4.0).
ja: この仕様は、Creative Commons Attribution License 4.0 (CC-BY-4.0) でライセンスされています。

source: The specification provides a method of measuring whether a program has obtained a base line level of quality and consistency.
ja: この仕様は、プログラムが基本レベルの品質と一貫性を持っているかどうかを評価する一つの方法を提供します。

source: The specification was designed to provide a core set of requirements to ensure a certain level of program quality has been achieved.
ja: この仕様は、コンプライアンス プログラムが一定水準の品質を達成していることを確かなものにするための要件一式を提供するよう策定されています。

source: There are also three committees with paid membership:
ja: さらに、有料会員制の三つの委員会があります。

source: There are many different ways to construct a FOSS compliance program (how and when) such that each way would satisfy the specification.
ja: FOSSコンプライアンス プログラム (「どうやって」と「いつ」) の構成にはたくさんの異なる方法があり、いずれの方法でもこの仕様を満足することができるでしょう。

source: There were and are no specific requirements for participating.
ja: 参加することに特段の要件は設けていません。

source: These can include digital documents, websites or paper documents public or private.
ja: 証跡には、公開・非公開を問わず、ディジタル文書、ウェブサイト、紙の文書が含まれます。

source: These resources can be found in the Linux Foundation Open Compliance Program .
ja: これらのリソースについては、 Linux Foundation Open Compliance Program をご覧ください。

source: They are split into chapters to allow flexible delivery across different timescales and – given the CC-0 licensing – to allow companies to “pick and choose” the sections they need to expand on any existing in-house training materials.
ja: この資料は複数の章に分かれているので、異なる時間割で柔軟に伝達することもできます。また、CC-0 でライセンスされているので、各社が必要なセクションを取捨選択して、自社の既存のトレーニング資料を拡張するのに利用することもできます。

source: The OpenChain Specification 1.1 is our latest industry-standard.
ja: OpenChain 仕様 1.1 が、私たちが策定した最新の業界標準規格です。

source: This allows a software supplier to represent to their users that the compliance artifacts they deliver were prepared under a FOSS program that met a standard level of quality.
ja: これにより、ソフトウェアのサプライヤはそのユーザに対して、自身が提供するコンプライアンス 証跡が、標準的なレベルの品質を満たしたFOSS プログラム下で作成されたと表明することができます。

source: To define a core set of requirements a FOSS compliance program should satisfy to achieve: a level of trust that an organization provides the artifacts required to achieve FOSS license compliance for software it shares with others.
ja: あるFOSSコンプライアンス プログラムが満足すべき一連の要件を定義することです。これは、組織が他者と共有するソフトウェアについて、FOSSライセンス コンプライアンスを達成するのに必要な証跡を組織が提供するという、一定水準の信頼です。

source: Understand FOSS Community Engagement
ja: FOSSコミュニティへの（積極的な）関わり方の理解

source: Visit the OpenChain Community website for information on how to join and contribute.
ja: 参加や貢献の方法についての情報は OpenChain コミュニティのウェブサイト にありますのでご覧ください。

source: We maintain a list of OpenChain Conformant Organizations .
ja: OpenChain 適合組織のリストをご覧ください。 .

source: What are the components of OpenChain ?
ja: OpenChain の構成要素とは何ですか?

source: What does it mean that a software offering is OpenChain Conforming?
ja: あるソフトウェアの提供が OpenChain 適合であるということは、何を意味しますか？

source: What if I don’t agree with a submission made by another organization?
ja: もし、他の組織による提出物に同意できないときは、どうすればよいですか？

source: What if I want to change my submission?
ja: 一旦提出した内容を変更したい場合はどうすればよいですか？

source: What is OpenChain ?
ja: OpenChain とは何ですか?

source: What is meant by Artifacts?
ja: 証跡とはどういう意味ですか？

source: What is the OpenChain Curriculum used for?
ja: OpenChain カリキュラムはどのように使われますか？

source: What is the OpenChain specification for?
ja: OpenChain 仕様の目的を教えてください。

source: What is the license of the OpenChain Specification?
ja: OpenChain 仕様のライセンスを教えてください。

source: What is the objective of OpenChain Conformance Self-Certification?
ja: OpenChain 適合自己認証の目的を教えてください。

source: What is the projected length of the OpenChain Curriculum slide training session?
ja: OpenChain カリキュラムのスライド資料によるトレーニングセッションは、どのくらいの時間を想定していますか？

source: What is the relationship between OpenChain and the CII Best Practices?
ja: OpenChain と CII Best Practices の関係を教えてください。

source: What jurisdiction does the IP law section cover?
ja: 知的所有権のセクションは、どの法域を対象にしていますか？

source: What response time should I expect to a submittal request?
ja: 提出した認証要求に対する応答時間はどのくらいと考えればよろしいですか？

source: When a software supplier states they are OpenChain conforming it means they have a program that satisfies all the requirements of the OpenChain specification.
ja: ソフトウェアのサプライヤが OpenChain 適合であると宣言しているとき、そのサプライヤのコンプライアンスプログラムが OpenChain 仕様のすべての要件を満足していることを意味します。

source: Where can I access the OpenChain Online Self-Certification?
ja: OpenChain オンライン自己認証には、どこからアクセスできますか？

source: Where can I find out more about Getting Started with OpenChain Self-Certification?
ja: OpenChain 自己認証に着手するにあたって、さらなる情報はありますか？

source: Where can I get the current version of the specification?
ja: 最新版の仕様はどこで手に入りますか？

source: Where can I learn more about each aspect of OpenChain ?
ja: OpenChain の各側面についてさらに学べる場所はありますか？

source: Who is the OpenChain Curriculum intended for?
ja: OpenChain カリキュラムの利用者としては、誰を意図していますか？

source: Yes.
ja: はい。

source: You can join the OpenChain Curriculum Mailing List .
ja: OpenChain カリキュラム メーリングリストに参加してください。

source: You can start below!
ja: 以下をぜひご覧ください！

source: You can then re-submit the conformance check.
ja: その後、適合チェックを再提出できます。

source: You should expect a response within 4 weeks.
ja: 回答期間は四週間以内とお考えください。

source: You will see an Unsubmit button at the bottom of the page after signing in to the Online Self-Certification site.
ja: Online Self-Certification サイトにサインインすると、ページの一番下に Unsubmit ボタンがあります。
